In [2]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

#### Read data

In [3]:
salary_data = pd.read_csv('data/Dataset.csv')

salary_data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [4]:
salary_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Gender               373 non-null    object
 2   Education Level      373 non-null    object
 3   Job Title            373 non-null    object
 4   Years of Experience  373 non-null    float64
 5   Salary               373 non-null    float64
dtypes: float64(3), object(3)
memory usage: 17.7+ KB

In [5]:
salary_data.shape

(375, 6)

#### Rename coloumns

In [7]:
salary_data.columns=['Age', 'Gender', 'Degree', 'Job_Title', 'Experience_years', 'Salary']

salary_data.head()

    Age  Gender      Degree          Job_Title  Experience_years    Salary
0  32.0    Male  Bachelor's  Software Engineer               5.0   90000.0
1  28.0  Female    Master's       Data Analyst               3.0   65000.0
2  45.0    Male         PhD     Senior Manager              15.0  150000.0
3  36.0  Female  Bachelor's    Sales Associate               7.0   60000.0
4  52.0    Male    Master's           Director              20.0  200000.0

In [8]:
salary_data.dtypes

Age                 float64
Gender               object
Degree               object
Job_Title            object
Experience_years    float64
Salary              float64
dtype: object

#### Check for duplicate records

In [11]:
# Assume salary_data is your DataFrame
duplicate_rows = salary_data.duplicated()

# Check if there are any duplicate rows
has_duplicates = duplicate_rows.any()

# Print result
print(f"Are there any duplicate rows? {has_duplicates}")

# If you want to see the count of duplicate rows
duplicate_count = duplicate_rows.sum()
print(f"Number of duplicate rows: {duplicate_count}")

Are there any duplicate rows? True
Number of duplicate rows: 50